Конфигурация/Documents/ПереоценкаВалютныхЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаВалютныхЦенностей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаВалютныхЦенностей/Ext/ManagerModule.bsl
Функция НужнаПерекурсовка(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт  
	
	ДатаПереоценки = НачалоДня(Дата);
	
	// #404987 - хардкод для Большого: задолженность по погашению (тела или купона) на 500х счетах нужно перекурсовать ЕЖЕДНЕВНО
	Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
		Если КлиентДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация,
				|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
				|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
				|			&Период,
				|			Счет.Родитель В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения)),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
				|			СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела))
				|				И Валюта <> &ВалютаУчета) КАК ЕдиныйБухгалтерскийУчетОстатки";
			
			Запрос.УстановитьПараметр("ВалютаУчета", Организация.ВалютаУчета);
			Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
			
				Возврат Истина;
			
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЕсли;
	// #404987
	
	ПериодичностиДатыПереоценки = БухгалтерскийУчетЕПС.ПолучитьПериодичностиДаты(ДатаПереоценки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиПоВидуУчетаСрезПоследних.ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств КАК ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств,
		|	НастройкиПоВидуУчетаСрезПоследних.ПерекурсовыватьВНерабочиеДни КАК ПерекурсовыватьВНерабочиеДни
		|ИЗ
		|	РегистрСведений.НастройкиПоВидуУчета.СрезПоследних(
		|			&НаДату,
		|			Организация = &Организация
		|				И ВидУчета = &ВидУчета
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиПоВидуУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПериодичностьПерекурсовки = Неопределено;
	ПерекурсовыватьВНерабочиеДни = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПериодичностьПерекурсовки = ВыборкаДетальныеЗаписи.ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств;
		ПерекурсовыватьВНерабочиеДни = ВыборкаДетальныеЗаписи.ПерекурсовыватьВНерабочиеДни;
	КонецЦикла;
	
	ПоследняяРабочаяДата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский,НачалоДня(ДатаПереоценки));
	
	Если ПериодичностьПерекурсовки = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
		Возврат Ложь;
	ИначеЕсли ПериодичностьПерекурсовки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно И ПериодичностиДатыПереоценки.ПериодичностьДень Тогда
		Если ПоследняяРабочаяДата <> ДатаПереоценки Тогда
			//	конец месяца это конец учетного периода
			//	и в конце месяца всегда нужно делать переоценку, независимо от настроек
			//	это было сделано для ЦБ и задолженностей 
			//	теперь сделал для перекурсовок
			//	#545840 - для ЕПС
			//	#546034 - для БУ/НУ
			Если ПериодичностиДатыПереоценки.ПериодичностьМесяц И ДатаПереоценки >= '20240601' Тогда
				Возврат Истина;
			Иначе
				Возврат ПерекурсовыватьВНерабочиеДни;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПерекурсовки, ДатаПереоценки) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НужнаПерекурсовкаДрагоценныеМеталлы(Дата, Организация, СчетДоверительногоУправления, ВидУчета) Экспорт
	
	ПериодичностьПереоценки 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПериодичностьПереоценки");
	ПереоцениватьВНерабочиеДни 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПереоцениватьВНерабочиеДни");
	ПереоцениватьВДеньОперации 	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, Справочники.УчетныеАктивы.ДрагоценныеМеталлы, ВидУчета, "ПереоцениватьВДеньОперации");
	
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, Дата);
	РабочийДень			= Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, Дата);
	
	Перекурсовывать = Ложь;
	
	Если Не Перекурсовывать И ЗначениеЗаполнено(ПериодичностьПереоценки)
		И ПериодичностьПереоценки <> Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
	
		Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
			Если РабочийДень Тогда
				Перекурсовывать = Истина;
			ИначеЕсли ПереоцениватьВНерабочиеДни Тогда
				Перекурсовывать = Истина;
			КонецЕсли;
		Иначе
			Переоценивать = БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, Дата, КалендарьДляСчетаДУ);
		КонецЕсли;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Сделка
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&Граница,
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Перекурсовывать = Не Запрос.Выполнить().Пустой();
	
	Возврат Перекурсовывать;
	
КонецФункции
